In [1]:
import pandas as pd
import numpy as np
from pymongo import MongoClient
import os
import pandas as pd
from urllib.parse import quote_plus
from pprint import pprint

# Connect to MongoDB

In [2]:
host = os.environ.get("MONGO_TEST_HOST") # the full host path is constructed via variables
port = os.environ.get("MONGO_TEST_PORT") # The port is default therefore unused
username = os.environ.get("MONGO_TEST_USER")
password = os.environ.get("MONGO_TEST_PW")
db = os.environ.get("MONGO_TEST_DB")

In [3]:
fake_pw = "p@ssw0rd'9'!"
print(quote_plus(fake_pw))

p%40ssw0rd%279%27%21

In [4]:
uri = "mongodb+srv://%s:%s@%s" % (
    quote_plus(username), quote_plus(password), host)
client = MongoClient(uri)

In [5]:
client.list_database_names()

['sample_airbnb',
 'sample_analytics',
 'sample_geospatial',
 'sample_guides',
 'sample_mflix',
 'sample_restaurants',
 'sample_supplies',
 'sample_training',
 'sample_weatherdata',
 'admin',
 'local']

In [19]:
db = "sample_analytics"
mydb = client[db]
pprint(mydb.list_collection_names())

['accounts', 'transactions', 'customers']

In [10]:
pprint(mycol.find_one())

{'_id': ObjectId('5ca4bbc7a2dd94ee5816238c'),
 'account_id': 371138,
 'limit': 9000,
 'products': ['Derivatives', 'InvestmentStock']}

## Accounts

In [12]:
mycol = mydb["accounts"]
df_accounts = pd.DataFrame(list(mycol.find()))

In [13]:
df_accounts.sample(5)

,_id,account_id,limit,products
672,5ca4bbc7a2dd94ee5816262f,120270,10000,"[InvestmentFund, Derivatives, InvestmentStock]"
1371,5ca4bbc7a2dd94ee581628ea,680724,10000,"[Brokerage, InvestmentStock]"
1087,5ca4bbc7a2dd94ee581627ce,639934,10000,"[CurrencyService, Derivatives, Commodity, Inve..."
1360,5ca4bbc7a2dd94ee581628df,486521,10000,"[InvestmentStock, Commodity, CurrencyService]"
1217,5ca4bbc7a2dd94ee58162850,212579,10000,"[InvestmentStock, CurrencyService, InvestmentF..."

In [20]:
df_accounts.shape

(1746, 4)

In [35]:
df_accounts.limit.describe()

count     1746.000000
mean      9955.899198
std        354.750195
min       3000.000000
25%      10000.000000
50%      10000.000000
75%      10000.000000
max      10000.000000
Name: limit, dtype: float64

## Transactions

In [15]:
# Create a collection and return all records
mycol = mydb["transactions"]
df_transactions = pd.DataFrame(list(mycol.find()))

In [16]:
df_transactions.sample(5)

,_id,account_id,transaction_count,bucket_start_date,bucket_end_date,transactions
858,5ca4bbc1a2dd94ee5816200e,525945,92,1998-01-25,2017-01-07,"[{'date': 2008-10-31 00:00:00, 'amount': 296, ..."
1474,5ca4bbc1a2dd94ee58162276,97500,23,1985-02-28,2016-10-15,"[{'date': 2013-04-12 00:00:00, 'amount': 5182,..."
1502,5ca4bbc1a2dd94ee58162292,51645,71,1964-11-12,2016-12-28,"[{'date': 1972-08-15 00:00:00, 'amount': 9831,..."
874,5ca4bbc1a2dd94ee5816201e,349536,29,1993-06-14,2016-10-26,"[{'date': 2010-03-05 00:00:00, 'amount': 712, ..."
750,5ca4bbc1a2dd94ee58161fa2,716490,2,2002-06-24,2013-04-07,"[{'date': 2008-01-07 00:00:00, 'amount': 3715,..."

In [24]:
df_transactions.shape

(1746, 6)

In [34]:
df_transactions.transaction_count.describe()

count    1746.000000
mean       50.469072
std        29.208889
min         1.000000
25%        24.000000
50%        52.000000
75%        76.000000
max       100.000000
Name: transaction_count, dtype: float64

## Customers

In [17]:
# Create a collection and return all records
mycol = mydb["customers"]
df_customers = pd.DataFrame(list(mycol.find()))

In [18]:
df_customers.sample(5)

,_id,username,name,address,birthdate,email,active,accounts,tier_and_details
370,5ca4bbcea2dd94ee58162bdd,hardinsharon,Jodi Hunter,"1564 Lopez Manors Suite 771\nWest Dustin, MA 2...",1976-01-13 07:09:05,lynnpierce@gmail.com,NaN,[304194],{}
469,5ca4bbcea2dd94ee58162c40,audreyortiz,Kim Garcia,"010 Lauren Rapid\nLake Erin, IN 93273",1988-12-22 22:08:38,alyssahahn@yahoo.com,NaN,[448268],{}
155,5ca4bbcea2dd94ee58162b05,hurstmatthew,Stacey Grimes,"0959 Sean Manor\nGregoryville, IL 51370",1970-11-14 00:00:19,calderonchad@hotmail.com,NaN,"[990274, 300879, 280906, 692927, 204117]",{'ab726a9b9c9b47898d1a7fd567864df1': {'tier': ...
39,5ca4bbcea2dd94ee58162a8f,portermaria,Sarah White,USCGC Williams\nFPO AP 67784,1987-01-29 13:29:53,christensenallison@yahoo.com,NaN,"[898156, 124603]",{}
477,5ca4bbcea2dd94ee58162c48,greenmelanie,Joshua Williams,Unit 6711 Box 5373\nDPO AP 24106,1996-06-27 06:51:35,jonathonturner@gmail.com,NaN,"[205355, 202946, 362683, 111626, 486521]",{'6c763525405a4dc69231122051518572': {'tier': ...